
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем вложения текущей задачи.
	ЗаполнитьВложения();
	УстановитьВидимостьВложений();
	
	Если Не Объект.Прочитан Тогда
		Объект.Прочитан = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложения()

	Вложения.Очистить();
	ТаблицаВложения = ОбщегоНазначенияВызовСервера.ПолучитьВложения(Объект.Ссылка);

	Для Каждого Строка Из ТаблицаВложения Цикл
		НоваяСтрока = Вложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

	//УстановитьВысотуТаблицыВложения();

	Если Вложения.Количество() = 0 Тогда
		Элементы.ВложенияНадпись.Видимость = Ложь; 
		
	ИначеЕсли Вложения.Количество() <= 3 Тогда 		
		Элементы.Вложения.Видимость = Истина; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВложений()

	КоличествоВложений = Вложения.Количество();

	ВидимостьСсылки = КоличествоВложений > 0;
	
	Элементы.Вложения.Видимость        = ВидимостьСсылки;
	Элементы.ВложенияНадпись.Видимость = ВидимостьСсылки;

КонецПроцедуры

&НаКлиенте
Процедура ОформитьКнопкиВложений()

	КоличествоВложений = Вложения.Количество();

	Если КоличествоВложений = 0 Тогда
		Элементы.Вложения.Видимость = Ложь;
	КонецЕсли;

	Элементы.ВложенияНадпись.Заголовок = 
		СтрШаблон(
			НСтр("ru = '%1 Вложения (%2)'; en = '%1 Attachments (%2)'"),
			?(Элементы.Вложения.Видимость = 0, "►","▼"),
			Строка(КоличествоВложений));

		КонецПроцедуры 

&НаКлиенте
Процедура ВложенияНадписьНажатие(Элемент)
	
	Элементы.Вложения.Видимость = Не Элементы.Вложения.Видимость;
	
	ОформитьКнопкиВложений();
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОформитьКнопкиВложений();
	
КонецПроцедуры

///////////////////////////////////////////////////////////
&НаСервере
Функция СохранитьФайлик(ТекущиеДанные, ИмяФайла)
		
	Данные = ТекущиеДанные.Данные.Получить();
	
	Данные.Записать(ИмяФайла);
	
	Возврат Истина;
КонецФункции	

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Вложения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТолькоЗаголовок Тогда
		//РаботаСФайламиИПредметамиКлиент.ЗадатьВопросОЗагрузкеФайла(ТекущиеДанные, ЭтаФорма); 
	Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
		
		Если СохранитьФайлик(ТекущиеДанные.Ссылка, ИмяФайла) Тогда
			ЗапуститьПриложение(ИмяФайла);
		КонецЕсли;	
		
	КонецЕсли;     
	
КонецПроцедуры
