
#Область УзлыОбмена

Функция ПолучитьЭтотУзелОбмена() Экспорт
	
	Узел = ПланыОбмена.ОбменССервером.ЭтотУзел();
		
	Если ЗначениеЗаполнено(Узел.Код) Тогда 		
		КодУстройства = Узел.Код;		
	Иначе                                 		
		КодУстройства = Новый УникальныйИдентификатор();
		НаименованиеУстройства = "М1";
		
		ОбъектУзла              = Узел.ПолучитьОбъект();
		ОбъектУзла.Код          = КодУстройства;
		ОбъектУзла.Наименование = НаименованиеУстройства;
		ОбъектУзла.Записать(); 		
	КонецЕсли;
	
	Возврат Узел;
	
КонецФункции	

Функция ПолучитьЦентральныйУзел() Экспорт
	
	ЦентральныйУзел = ПланыОбмена.ОбменССервером.НайтиПоКоду("001");
	
	Если ЦентральныйУзел.Пустая() Тогда
		
		НовыйУзел = ПланыОбмена.ОбменССервером.СоздатьУзел();
		НовыйУзел.Код = "001";
		НовыйУзел.Наименование = "ЦБ";
		НовыйУзел.Записать();
		ЦентральныйУзел = НовыйУзел.Ссылка;		
	КонецЕсли;
	
	Возврат ЦентральныйУзел;
	
КонецФункции

Функция ПолучитьКодУстройства() Экспорт
	
	Узел = ПолучитьЭтотУзелОбмена();
	
	Возврат Узел.Код;
	
КонецФункции

 #КонецОбласти					 