
// Добавляет событие типа Информация в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьИнформацию(Событие, Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьИнформацию(Событие, Описание);

КонецФункции

// Добавляет событие типа Предупреждение в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьПредупреждение(Событие,Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьПредупреждение(Событие, Описание);

КонецФункции

// Добавляет событие типа Ошибка в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи сообщения об ошибке.
//
Функция ДобавитьОшибку(Событие, Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьОшибку(Событие, Описание);

КонецФункции
