
//Код - код справочника
//Альтернатива - УИД 
Функция ПолучитьСтруктуруФайлаДляОтправки(Код) Экспорт   
	
	СтруктураФайла = Неопределено;
	
	Если ЗначениеЗаполнено(Код) Тогда 
		
		//Если будем юзать УИД
		//ИД = Новый УникальныйИдентификатор(УИД);
		//Файлик = Справочники.Файлы.ПолучитьСсылку(ИД);		
		
		Файлик = Справочники.Файлы.НайтиПоКоду(СокрЛП(Код));
						
		Если ЗначениеЗаполнено(Файлик) Тогда			
			
			СтруктураФайла = Новый Структура();
			СтруктураФайла.Вставить("Наименование", Файлик.Наименование);
			СтруктураФайла.Вставить("Расширение"  , Файлик.Расширение);
			СтруктураФайла.Вставить("Размер"      , Файлик.Размер);
			СтруктураФайла.Вставить("Автор"       , Строка(Файлик.Автор));
			СтруктураФайла.Вставить("КодВБазе"    , Код);
						
			ДДФайла       = Файлик.Данные.Получить();
			ДДФайлаBase64 = Base64Строка(ДДФайла);
			
			СтруктураФайла.Вставить("Данные"	  , ДДФайлаBase64);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураФайла;
	
КонецФункции

Функция СоздатьФайлИзСтруктуры(СтруктураФайла, Владелец) Экспорт
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайл.Наименование  = СтруктураФайла.Наименование;
	НовыйФайл.Расширение    = СтруктураФайла.Расширение;
	НовыйФайл.Автор         = СтруктураФайла.Автор;
	НовыйФайл.ВладелецФайла = Владелец;
	НовыйФайл.Размер        = СтруктураФайла.Размер;
	НовыйФайл.КодВБазе      = СтруктураФайла.КодВБазе;
	
	ДанныеФайла = Base64Значение(СтруктураФайла.Данные); 
	НовыйФайл.Данные = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));	
	
	НовыйФайл.Записать();
	
	Возврат НовыйФайл.Ссылка;
	
КонецФункции	