
Функция ПолучитьДемоДанные() Экспорт
	
	АдресСервера = "192.168.100.5";//Константы.АдресСервера.Получить(); //ip. н-р, 192.168.1.211
	ИмяСервиса   = "/Finito/hs/Mobile/";//Константы.ИмяСервиса.Получить();  //"/ws" + "/hs/Exchange/" 
	ИмяЗапроса   = "GetFileAction/";//"findBarcode/"; 
	ПараметрЗапроса = "000000001";
	Ответ = "";
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера); 
	Исключение
		Возврат "Ошибка при создании HTTP соединения.";
	КонецПопытки;
	
	HTTPЗапрос = Новый HTTPЗапрос(ИмяСервиса + ИмяЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрЗапроса);
		
	Попытка
		HTTPОтвет = Соединение.Записать(HTTPЗапрос, Ответ);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		Возврат "Ошибка при соединении.";
	КонецПопытки;
	//Сообщить(Ответ);
	Если Не ПустаяСтрока(Ответ) Тогда 
		Ответ = Десериализовать(Ответ);	  
	КонецЕсли; 			  
	
	Возврат Ответ;
	
	
КонецФункции

//Работа с JSON
Функция Десериализовать(СтрокаИзJSON) 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаИзJSON);
	Структура = ПрочитатьJSON(Чтение,,"Дата, СрокИсполнения, ДатаСписания",ФорматДатыJSON.ISO);
	Чтение.Закрыть();
	
	Возврат Структура;
	//	
КонецФункции
