
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись о результате выполнения задачи.
//
// Параметры:
//  Задача		 - Справочник.Задачи - Ссылка на задачу;
//  Результат	 - Число - Идентификатор результата выполнения задачи;
//  Комментарий	 - Строка - Комментарий выполнения задачи (резолюция, виза).
//
Процедура ДобавитьЗаписьОВыполнении(Задача, Результат, Комментарий) Экспорт

	МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияЗадач.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Объект         = Задача;
	МенеджерЗаписи.ДатаВыполнения = ТекущаяДата();
	МенеджерЗаписи.Комментарий    = Комментарий;
	МенеджерЗаписи.Результат      = Результат;

	МенеджерЗаписи.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
