
Процедура ОтправитьIDНаСервер(IDПодписчика) Экспорт
			
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(IDПодписчика); 
		
	ФоновыеЗадания.Выполнить("PushУведомленияСервер.ОтправитьIDНаСерверВФоне", ПараметрыЗадания, , "ОтправкаIDПодписчика");
	
КонецПроцедуры

Процедура ОтправитьIDНаСерверВФоне(ПараметрыЗапроса) Экспорт
	
	IDПодписчика  = ПараметрыЗапроса;
	КодУстройства = ОбменМобильноеПриложениеСервер.ПолучитьКодУстройства();
	
	RegInfo = Новый Структура;
	RegInfo.Вставить("IDПодписчика" , IDПодписчика);
	RegInfo.Вставить("КодУстройства", КодУстройства);
	
	АдресСервера = "192.168.100.5";//Константы.АдресСервера.Получить(); //ip. н-р, 192.168.1.211
	ИмяСервиса   = "/Fin/hs/Mobile/";//Константы.ИмяСервиса.Получить();  //"/ws" + "/hs/Exchange/" 
	ИмяЗапроса   = "regpushAction/";//"findBarcode/"; 
	
	Логин  = Константы.ПользовательЦентральнойБазы.Получить();
	Пароль = Константы.Пароль.Получить();
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера,, Логин, Пароль,,5,,Истина);
		
		//Соединение = Новый HTTPСоединение(АдресСервера,,);
		// первым параметров HTTPЗапрос является адрес ресурса
		// в данном случае сначала идет имя серверной базы, под которым она опубликована на вэб-сервере
		// т.к. мы использовали http-сервис, то после имени идет служебный параметр hs
		// при создании http-сервиса мы указывали коревой URL - testpush 
		// т.к. в сервисе 1 нас всего один метод, и он имеет тип GET, то через знак ? укажем имя параметра reginfo
		// и далее сериализованный IDПодписчика
		// если все ок, то в браузере можно набрать полученный URL и на нашем Сервере все отработает как нужно
			
		Запрос 	   = Новый HTTPЗапрос(ИмяСервиса + ИмяЗапроса + "?reginfo=" + Сериализовать(RegInfo));
		Запрос.Заголовки.Вставить("Content-Type","text/xml; charset=UTF-8");
		Соединение.ВызватьHTTPМетод("GET", Запрос);	
	Исключение
		ПротоколСобытийВызовСервера.ДобавитьОшибку("Отправка User Push ID", ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Функция Сериализовать(Данные)

	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(Данные);
	ЗаписьXML = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь);
	ЗаписьXML.УстановитьСтроку(ПараметрыЗаписиXML);
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	
	Возврат ЗаписьXML.Закрыть();

КонецФункции // Сериализовать()


//Функция Сериализовать(Значение) Экспорт
//	
//	НастройкиСериализации = Новый НастройкиСериализацииJSON;
//	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
//	НастройкиСериализации.ВариантЗаписиДаты 	 = ВариантЗаписиДатыJSON.УниверсальнаяДата;
//	
//	Запись = новый ЗаписьJSON;
//	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
//	Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
//	ЗаписатьJSON(Запись,Значение, НастройкиСериализации);
//	
//	Возврат Запись.Закрыть();
//	
//КонецФункции
//http://1c.ruboard.ru/public/606748/