#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьКонстанты();
	
	УстановитьДоступностьЗадатьКодДоступа();
	
	УстановитьСостояниеАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//ЗаписатьКонстанты(); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрошелОбмен" Тогда
		УстановитьСостояниеАвторизации();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедуры

&НаСервере
Процедура ПрочитатьКонстанты()
			
	КодДоступаВключен                 = ЗначениеЗаполнено(Константы.КодДоступа.Получить());
	ИспользоватьФоновуюСинхронизацию  = Константы.ИспользоватьФоновуюСинхронизацию.Получить();
	ИспользоватьТолькоWiFi            = Константы.ИспользоватьТолькоWiFi.Получить();
	МаксимальныйРазмерФайла           = Константы.МаксимальныйРазмерФайла.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанты()
	
	//Набор = РеквизитФормыВЗначение("НаборКонстант");
	//Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЗадатьКодДоступа()
	
	Элементы.ГруппаНастройкаКодДоступа.Видимость = КодДоступаВключен;
	
КонецПроцедуры

#КонецОбласти

#Область Безопасность

&НаКлиенте
Процедура ЗадатьКодДоступа(Команда)
	
	ОткрытьФормуМодально("ОбщаяФорма.УстановкаКодаДоступаВПриложение");

КонецПроцедуры

&НаКлиенте
Процедура КодДоступаПереключательПриИзменении(Элемент)
	
	Если КодДоступаВключен Тогда
		Результат = ОткрытьФормуМодально("ОбщаяФорма.УстановкаКодаДоступаВПриложение");
		Если Результат = Неопределено Тогда
			КодДоступаВключен = НЕ КодДоступаВключен;
		ИначеЕсли Результат <> Неопределено И НЕ Результат Тогда
			КодДоступаВключен = Ложь;
		КонецЕсли;
	Иначе
		Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводКодаДоступаВПриложение");
		Если Результат = Неопределено Тогда
			КодДоступаВключен = НЕ КодДоступаВключен;
		ИначеЕсли Результат <> Неопределено И Результат Тогда
			КодДоступаВключен = Ложь;
			ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("КодДоступа", "");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьЗадатьКодДоступа();

КонецПроцедуры

#КонецОбласти

#Область Подключение

&НаКлиенте
Процедура НаборКонстантИспользоватьФоновуюСинхронизациюПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьФоновуюСинхронизацию", ИспользоватьФоновуюСинхронизацию);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантИспользоватьТолькоWiFiПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьТолькоWiFi", ИспользоватьТолькоWiFi);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантМаксимальныйРазмерФайлаПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("МаксимальныйРазмерФайла", МаксимальныйРазмерФайла);
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеАвторизации()
	
	ИмяПользователя = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ПользовательЦентральнойБазы");
	СоединениеСЦБУстановлено = Истина;//Тестирование интерфейса//Константы.СоединениеСЦБУстановлено.Получить();
	Если СоединениеСЦБУстановлено Тогда
		Элементы.ПодключитьсяОтключиться.Заголовок = НСтр("ru='Настройки подключения';en='Synchronization Settings'");
	Иначе
		ИмяПользователя = НСтр("ru='Не подключен';en='Not sync'");
		Элементы.ПодключитьсяОтключиться.Заголовок = НСтр("ru='Подключиться к сервису';en='Synchronize'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСинхронизации(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизации"); 
КонецПроцедуры


#КонецОбласти