////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С БД
// - установка и получение значений параметров сеанса
// - обработка запуска приложения
// - получение значений реквизитов объекта
// - удаление данных приложения
// - удаление объекта
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает значение любой константы.
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

// Устанавливает значение любой константы.
//
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, Значение) Экспорт
	
	Константы[ИмяКонстанты].Установить(Значение);
	
Конецпроцедуры

#КонецОбласти

// Получает все файлы вложения по указанному объекту.
//
// Параметры:
//  Владелец - СправочникСсылка, ДокументСсылка - Объект-владелец файлов.
// 
// Возвращаемое значение:
//  Массив - Массив найденных вложений.
//
Функция ПолучитьВложения(Владелец) Экспорт

	Вложения = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВладелецФайла", Владелец);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка,
		|	Файлы.ТолькоЗаголовок,
		|	Файлы.Представление,
		|	Файлы.Размер,
		|	Файлы.Расширение
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Вложение = Новый Структура();
		Вложение.Вставить("Ссылка",Выборка.Ссылка);
		Вложение.Вставить("ТолькоЗаголовок",Выборка.ТолькоЗаголовок);
		Вложение.Вставить("Представление",Выборка.Представление);
		Вложение.Вставить("Размер",Выборка.Размер);
		Вложение.Вставить("Расширение",Выборка.Расширение);
		Вложение.Вставить("ИндексКартинки", 
			ОбщегоНазначенияКлиентСервер.ПолучитьИндексПиктограммыФайла(Выборка.Расширение));

		Вложения.Добавить(Вложение);

	КонецЦикла;

	Возврат Вложения;

КонецФункции
