
&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.Пароль.РежимПароля = НЕ Элементы.Пароль.РежимПароля;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьКонстанты();
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьКонстанты()
			
	АдресЦентральнойБазы        = Константы.АдресЦентральнойБазы.Получить();
	ПользовательЦентральнойБазы = Константы.ПользовательЦентральнойБазы.Получить();
	Пароль                      = Константы.Пароль.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЦентральнойБазыПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("АдресЦентральнойБазы", АдресЦентральнойБазы);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательЦентральнойБазыПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ПользовательЦентральнойБазы", ПользовательЦентральнойБазы);

КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("Пароль", Пароль);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолучить(Команда)
	//Временно
	Оповестить("ПрошелОбмен");
КонецПроцедуры

&НаКлиенте
Процедура УМеняЕстьКодНажатие(Элемент)
	
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОбработатьШтрихкод", ЭтаФорма);
			
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru='Отсканируйте штрихкод';en='Scan Barcode'"), Оповещение,, ТипШтрихКода.Двухмерный);
		Иначе
			Предупреждение(НСтр("ru='На этом устройстве сканирование штрихкодов не поддерживаются.';en='In this barcode scanning device is not supported.'"));
		КонецЕсли;
	#Иначе
		Штрихкод = "";
		Если ВвестиСтроку(Штрихкод, НСтр("en='Enter Barcode';ru='Введите адрес'"), 200) Тогда
			ОбработатьШтрихкод(Штрихкод, Истина);
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод, Результат, Сообщение = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат Тогда
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		МассивПодстрок = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(Штрихкод, ";");
		//Если МассивПодстрок.Количество() = 0 ИЛИ МассивПодстрок[0] <> "sbmcs" Тогда
		//	Предупреждение(НСтр("ru='Неверный QR-код. Попробуйте еще раз.'"));
		//	Возврат;
		//КонецЕсли;
		//Попытка
		//	НаборКонстант.АдресЦентральнойБазы = МассивПодстрок[1];
		//	НаборКонстант.ПользовательЦентральнойБазы = МассивПодстрок[2];
		//	НаборКонстант.Пароль = "";
		//	УстановитьНаименованиеУстройства();
		//	Попытка
		//		НаборКонстант.Пароль = МассивПодстрок[4];
		//	Исключение
		//	КонецПопытки;
		//	Если Найти(НаборКонстант.АдресЦентральнойБазы, "1cfresh.com") = 0 Тогда
		//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДругойСервис;
		//	Иначе
		//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаФреш;
		//	КонецЕсли;
		//	ИспользованQRКод = Истина;
		//	ЗаписатьКонстанты();
		//Исключение
		//	Предупреждение(НСтр("ru='Неподходящий QR-код. Попробуйте другой.'"));
		//	Возврат;
		//КонецПопытки
	КонецЕсли;
	
КонецПроцедуры
