
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ТекущаяДата = ТекущаяДата();
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", Параметры.ТекущаяДата);
	
	ТекущийТипОтображения        = 0;	
	СписокЗадачПустой            = Истина;
	ОписаниеПоследнегоОбновления = "Обновлено 5 минут назад";
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
			
	Если СписокЗадачПустой Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВсеЗадачиЗавершены;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСписокЗадач;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийТипОтображенияПриИзменении(Элемент)
	//для тестов
	
	Если ТекущийТипОтображения = 1 Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСписокЗадач;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВсеЗадачиЗавершены;
	КонецЕсли;	
	
	
КонецПроцедуры
