
// Добавляет событие в протокол событий
//
// Параметры:
//  Описание	 - Строка	 - Описание события;
//  ТипСобытия	 - Строка	 - Тип события.
// 
// Возвращаемое значение:
//  Число - Момент времени записи события по объекту.
//
Функция Добавить(Событие, Описание, ТипСобытия) Экспорт

	МенеджерЗаписиРегистра = РегистрыСведений.ПротоколСобытий.СоздатьМенеджерЗаписи();

	МенеджерЗаписиРегистра.Период        = ТекущаяДата();
	МенеджерЗаписиРегистра.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписиРегистра.ТипСобытия    = ТипСобытия;
	МенеджерЗаписиРегистра.Описание      = СокрЛП(Описание);
	МенеджерЗаписиРегистра.Событие       = СокрЛП(Событие);  

	МенеджерЗаписиРегистра.Записать();

	Возврат МенеджерЗаписиРегистра.МоментВремени;

КонецФункции

// Добавляет событие типа Информация в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьИнформацию(Событие, Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Информация);

КонецФункции

// Добавляет событие типа Предупреждение в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьПредупреждение(Событие,Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Предупреждение);

КонецФункции

// Добавляет событие типа Ошибка в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи сообщения об ошибке.
//
Функция ДобавитьОшибку(Событие, Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Ошибка);

КонецФункции
