
Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// При записи каждой 10-й записи удаляются записи протокола старше 7 дней.
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел();
	ОчередноеЧисло = ГенераторЧисел.СлучайноеЧисло(1, 10);
	Если ОчередноеЧисло = 5 Тогда

		ГраницаУдаления = ТекущаяДата() - 7 * 24 * 60 * 60;
		ПротоколВыборка = РегистрыСведений.ПротоколСобытий.Выбрать(, ГраницаУдаления);

		Пока ПротоколВыборка.Следующий() Цикл

			МенеджерЗаписи = РегистрыСведений.ПротоколСобытий.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период        = ПротоколВыборка.Период;
			МенеджерЗаписи.МоментВремени = ПротоколВыборка.МоментВремени;

			МенеджерЗаписи.Удалить();

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
